/**
 * Copyright (c) 2020, Alexander Kapralov
 */
package ru.capralow.dt.hrm.support.internal.personnelaccounting_v3_1.ui.pi;

import java.util.HashMap;
import java.util.Map;

import ru.capralow.dt.hrm.support.internal.personnelaccounting_v3_1.ui.Messages;

public final class PiAttributesList
{

    public static Map<String, String> getMandatoryAttributes(String piMethodName)
    {
        Map<String, String> attributes = new HashMap<>();

        if (piMethodName.equalsIgnoreCase("СоздатьВТКадровыеДанныеСотрудников")) //$NON-NLS-1$
        {
            // ЭтоОбязательноеПолеКадровыхДанныхСотрудника
            attributes.put("Период", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Сотрудник", "СправочникСсылка.Сотрудники"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ФизическоеЛицо", "СправочникСсылка.ФизическиеЛица"); //$NON-NLS-1$ //$NON-NLS-2$
        }

        return attributes;
    }

    public static Map<String, String> getSelectableAttributes(String piMethodName)
    {
        Map<String, String> attributes = new HashMap<>();

        if (piMethodName.equalsIgnoreCase("СоздатьВТКадровыеДанныеСотрудников")) //$NON-NLS-1$
        {
            // ЗапросВТПостоянныеКадровыеДанныеСотрудников
            attributes.put("ТабельныйНомер", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДатаПриема", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДатаУвольнения", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДатаЗавершенияРаботы", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТекущаяОрганизация", "СправочникСсылка.Организации"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТекущееПодразделение", "СправочникСсылка.ПодразделенияОрганизаций"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТекущаяДолжность", "СправочникСсылка.Должности"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТекущийВидЗанятости", "ПеречислениеСсылка.ВидыЗанятости"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОсновноеРабочееМестоВОрганизации", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОформленПоТрудовомуДоговору", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТекущаяДолжностьПоШтатномуРасписанию", "СправочникСсылка.ШтатноеРасписание"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТекущийВидДоговора", "ПеречислениеСсылка.ВидыДоговоровССотрудниками"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТекущаяТерритория", "СправочникСсылка.ТерриторииВыполненияРабот"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ТекущаяТарифнаяСтавка", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТекущийФОТ", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТекущаяНадбавка", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТекущийСпособРасчетаАванса", "ПеречислениеСсылка.СпособыРасчетаАванса"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТекущийАванс", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДатаНачалаУчета", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ПриказОПриеме", "ДокументСсылка.ПриемНаРаботу"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПриказОПриемеДата", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПриказОПриемеНомер", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПриказОПриемеДатаЗавершенияТрудовогоДоговора", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("КраткосрочныйТрудовойДоговор", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ПриказОбУвольнении", "ДокументСсылка.Увольнение"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПриказОбУвольненииДата", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПриказОбУвольненииНомер", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПриказОбУвольненииСтатьяТКРФ", //$NON-NLS-1$
                "СправочникСсылка.ОснованияУвольнения,СправочникСсылка.ОснованияУвольненияСГосударственнойСлужбы,СправочникСсылка.ОснованияУвольненияСМуниципальнойСлужбы"); //$NON-NLS-1$

            attributes.put("НазначениеПодработки", "ДокументСсылка.НазначениеПодработки"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПрекращениеПодработки", "ДокументСсылка.ПрекращениеПодработки"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ВладелецМестаВыплаты", //$NON-NLS-1$
                "СправочникСсылка.Сотрудники,СправочникСсылка.Организации,СправочникСсылка.ПодразделенияОрганизаций"); //$NON-NLS-1$
            attributes.put("ВидМестаВыплаты", "ПеречислениеСсылка.ВидыМестВыплатыЗарплаты"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("МестоВыплаты", //$NON-NLS-1$
                "СправочникСсылка.ФизическиеЛица,СправочникСсылка.Кассы,СправочникСсылка.Банки,СправочникСсылка.ЗарплатныеПроекты"); //$NON-NLS-1$

            // ЗапросВТКадровыеДанныеФизическихЛиц
            attributes.put("ГражданствоПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Страна", "СправочникСсылка.СтраныМира"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ИННВСтранеГражданства", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ДокументПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДокументВид", "СправочникСсылка.ВидыДокументовФизическихЛиц"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДокументКодМВД", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДокументСерия", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДокументНомер", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДокументДатаВыдачи", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДокументСрокДействия", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДокументКемВыдан", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДокументКодПодразделения", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДокументСтранаВыдачи", "СправочникСсылка.СтраныМира"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДокументПредставление", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ФИОПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Фамилия", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Имя", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Отчество", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ФИОПолные", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ФамилияИО", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ИОФамилия", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Инициалы", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ИнвалидностьПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Инвалидность", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ИнвалидностьДатаВыдачи", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ИнвалидностьСрокДействияСправки", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("СтатусНалогоплательщикаПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтатусНалогоплательщика", "СправочникСсылка.СтатусыНалогоплательщиковПоНДФЛ"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ВидЗастрахованногоЛицаПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВидЗастрахованногоЛица", //$NON-NLS-1$
                "ПеречислениеСсылка.ВидыЗастрахованныхЛицОбязательногоСтрахования"); //$NON-NLS-1$

            attributes.put("ОбщийСтажВид", "СправочникСсылка.ВидыСтажа"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийСтажПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийСтажРазмерДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийСтажРазмерМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийСтажДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийСтажМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийСтажЛет", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("СеверныйСтажВид", "СправочникСсылка.ВидыСтажа"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СеверныйСтажПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СеверныйСтажРазмерДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СеверныйСтажРазмерМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СеверныйСтажДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СеверныйСтажМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СеверныйСтажЛет", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("НепрерывныйСтажВид", "СправочникСсылка.ВидыСтажа"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("НепрерывныйСтажПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("НепрерывныйСтажРазмерДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("НепрерывныйСтажРазмерМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("НепрерывныйСтажДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("НепрерывныйСтажМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("НепрерывныйСтажЛет", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("СтажНаНадбавкуЗаВыслугуЛетВид", "СправочникСсылка.ВидыСтажа"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтажНаНадбавкуЗаВыслугуЛетПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтажНаНадбавкуЗаВыслугуЛетРазмерДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтажНаНадбавкуЗаВыслугуЛетРазмерМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтажНаНадбавкуЗаВыслугуЛетДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтажНаНадбавкуЗаВыслугуЛетМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтажНаНадбавкуЗаВыслугуЛетЛет", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ОбщийНаучноПедагогическийСтажВид", "СправочникСсылка.ВидыСтажа"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийНаучноПедагогическийСтажПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийНаучноПедагогическийСтажРазмерДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийНаучноПедагогическийСтажРазмерМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийНаучноПедагогическийСтажДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийНаучноПедагогическийСтажМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОбщийНаучноПедагогическийСтажЛет", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ПедагогическийСтажВид", "СправочникСсылка.ВидыСтажа"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПедагогическийСтажПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПедагогическийСтажРазмерДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПедагогическийСтажРазмерМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПедагогическийСтажДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПедагогическийСтажМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПедагогическийСтажЛет", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("СтраховойСтажВид", "СправочникСсылка.ВидыСтажа"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтраховойСтажПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтраховойСтажРазмерДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтраховойСтажРазмерМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтраховойСтажДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтраховойСтажМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтраховойСтажЛет", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("РасширенныйСтраховойСтажВид", "СправочникСсылка.ВидыСтажа"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("РасширенныйСтраховойСтажПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("РасширенныйСтраховойСтажРазмерДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("РасширенныйСтраховойСтажРазмерМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("РасширенныйСтраховойСтажДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("РасширенныйСтраховойСтажМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("РасширенныйСтраховойСтажЛет", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ПрочийСтажВид", "СправочникСсылка.ВидыСтажа"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПрочийСтажПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПрочийСтажРазмерДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПрочийСтажРазмерМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПрочийСтажДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПрочийСтажМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПрочийСтажЛет", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ВыслугаЛетНаГосударственнойСлужбеВид", "СправочникСсылка.ВидыСтажа"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаГосударственнойСлужбеПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаГосударственнойСлужбеРазмерМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаГосударственнойСлужбеРазмерДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаГосударственнойСлужбеДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаГосударственнойСлужбеМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаГосударственнойСлужбеЛет", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ВыслугаЛетНаВоеннойСлужбеВид", "СправочникСсылка.ВидыСтажа"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаВоеннойСлужбеПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаВоеннойСлужбеРазмерМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаВоеннойСлужбеРазмерДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаВоеннойСлужбеДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаВоеннойСлужбеМесяцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВыслугаЛетНаВоеннойСлужбеЛет", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("СостояниеВБракеПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СостояниеВБраке", "СправочникСсылка.СостояниеВБраке"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ВоинскийУчетПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетКатегорияЗапаса", "ПеречислениеСсылка.КатегорииЗапасаВоеннообязанных"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетЗвание", "СправочникСсылка.ЗванияГражданскогоВоинскогоУчета"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетСостав", "СправочникСсылка.СоставыВоеннослужащих"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетВУС", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетГодность", "ПеречислениеСсылка.ГодностьКВоеннойСлужбе"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетВоенкомат", "СправочникСсылка.Военкоматы"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетНомерКомандыПартии", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетПунктПеречня", "СправочникСсылка.ПереченьДолжностейДляБронированияГраждан"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетНаличиеМобпредписания", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетОтношениеКВоинскойОбязанности", //$NON-NLS-1$
                "ПеречислениеСсылка.ОтношениеКВоинскойОбязанности"); //$NON-NLS-1$
            attributes.put("ВоинскийУчетОтношениеКВоинскомуУчету", "ПеречислениеСсылка.ОтношениеКВоинскомуУчету."); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ВоинскийУчетЗабронированОрганизациейПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетЗабронированОрганизациейРегистратор", "ДокументСсылка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскийУчетЗабронированОрганизацией", "СправочникСсылка.Организации"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("КлассныйЧинРангПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("КлассныйЧинРанг", "СправочникСсылка.КлассныеЧиныРанги"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ВоинскоеСпециальноеЗваниеПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВоинскоеСпециальноеЗвание", "СправочникСсылка.ВоинскиеСпециальныеЗвания"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("КоличествоДетей", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("КоличествоИждивенцев", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("КоличествоРодственников", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            // ЗапросВТКадровыеДанныеСотрудников
            attributes.put("РабочееМестоПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("РабочееМестоРегистратор", "ДокументСсылка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Организация", "СправочникСсылка.Организации"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Подразделение", "СправочникСсылка.ПодразделенияОрганизаций"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Должность", "СправочникСсылка.Должности"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВидЗанятости", "ПеречислениеСсылка.ВидыЗанятости"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВидСобытия", "ПеречислениеСсылка.ВидыКадровыхСобытий"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("КоличествоСтавок", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДолжностьПоШтатномуРасписанию", "СправочникСсылка.ШтатноеРасписани"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВидДоговора", "ПеречислениеСсылка.ВидыДоговоровССотрудникам"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("МестоВСтруктуреПредприятия", "СправочникСсылка.СтруктураПредприятия"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("РазрядКатегорияПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("РазрядКатегорияРегистратор", "ДокументСсылка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("РазрядКатегория", "СправочникСсылка.РазрядыКатегорииДолжностей"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ПКУПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПКУРегистратор", "ДокументСсылка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПКУ", "СправочникСсылка.РазрядыКатегорииДолжностей"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("СостояниеПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Состояние", "ПеречислениеСсылка.СостоянияСотрудника"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ТерриторияПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТерриторияРегистратор", "ДокументСсылка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Территория", "СправочникСсылка.ТерриторииВыполненияРабот"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ЯвляетсяЧленомЛетногоЭкипажа", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ЯвляетсяШахтером", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ЯвляетсяФармацевтом", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ЯвляетсяРаботникомСДосрочнойПенсией", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ЯвляетсяЧленомЭкипажаСуднаПодФлагомРФ", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТарифнаяСетка", "СправочникСсылка.ТарифныеСетки"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТарифнаяСеткаНадбавки", "СправочникСсылка.ТарифныеСетки"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("КлассныйЧинРангДолжности", "СправочникСсылка.КлассныеЧиныРанги"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ОплатаТрудаПериодЗаписи", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОплатаТрудаРегистратор", "ДокументСсылка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ТарифнаяСтавка", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ФОТ", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Надбавка", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОсновноеНачисление", "ПланВидовРасчета.Начисления"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПоказательТарифнойСтавки", "СправочникСсылка.ПоказателиРасчетаЗарплаты"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("СовокупнаяТарифнаяСтавкаПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СовокупнаяТарифнаяСтавкаРегистратор", "ДокументСсылка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СовокупнаяТарифнаяСтавка", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВидСовокупнойТарифнойСтавки", "ПеречислениеСсылка.ВидыТарифныхСтавок"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ПорядокРасчетаСтоимостиЕдиницыВремениПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПорядокРасчетаСтоимостиЕдиницыВремениРегистратор", "ДокументСсылка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПорядокРасчетаСтоимостиЕдиницыВремени", //$NON-NLS-1$
                "ПеречислениеСсылка.ПорядокРасчетаСтоимостиЕдиницыВремениОплатыТруда"); //$NON-NLS-1$

            attributes.put("ГрейдПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ГрейдРегистратор", "ДокументСсылка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Грейд", "СправочникСсылка.Грейды"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ГрафикРаботыПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ГрафикРаботыРегистратор", "ДокументСсылка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ГрафикРаботы", "СправочникСсылка.ГрафикиРаботыСотрудников"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СуммированныйУчетРабочегоВремени", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СреднемесячноеЧислоЧасов", "Число"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СреднемесячноеЧислоДней", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ДоляНеполногоРабочегоВремени", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("АвансПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("АвансРегистратор", "ДокументСсылка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СпособРасчетаАванса", "ПеречислениеСсылка.СпособыРасчетаАванса"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("Аванс", "Число"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ЗарплатныйПроектДатаОткрытияЛицевогоСчета", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ЗарплатныйПроектРегистратор", //$NON-NLS-1$
                "ДокументСсылка.ПодтверждениеОткрытияЛицевыхСчетовСотрудников"); //$NON-NLS-1$
            attributes.put("ЗарплатныйПроект", "СправочникСсылка.ЗарплатныеПроекты"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("НомерЛицевогоСчета", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("УчетЗатратПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СтатьяФинансирования", "СправочникСсылка.СтатьиФинансированияЗарплата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СпособОтраженияЗарплатыВБухучете", "СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОтношениеКЕНВД", "ПеречислениеСсылка.ОтношениеКЕНВДЗатратНаЗарплату"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("УчетЗатратДокументОснование", "ДокументСсылка.ПриемНаРаботу"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ДатаДоговораКонтракта", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("НомерДоговораКонтракта", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДатаНачала", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ПоступлениеНаСлужбуВпервые", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$

            attributes.put("ПредставительНанимателя", "СправочникСсылка.ФизическиеЛица"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДолжностьПредставителяНанимателя", "СправочникСсылка.Должности"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОснованиеПредставителя", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ВидАктаГосоргана", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ДатаОкончания", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СрочныйДоговор", "Булево"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("СрокЗаключенияДоговора", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОборудованиеРабочегоМеста", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ИныеУсловияДоговора", "Строка"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("ОснованиеСрочногоДоговора", //$NON-NLS-1$
                "СправочникСсылка.ОснованияЗаключенияСрочныхКонтрактовГосслужащих,СправочникСсылка.ОснованияЗаключенияСрочныхДоговоровМуниципальныхСлужащих,СправочникСсылка.ОснованияЗаключенияСрочныхТрудовыхДоговоров"); //$NON-NLS-1$

            attributes.put("КлассУсловийТрудаПериодРегистрации", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("КлассУсловийТруда", "ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки"); //$NON-NLS-1$ //$NON-NLS-2$
            attributes.put("КлассУсловийТрудаДатаРегистрацииИзменений", "Дата"); //$NON-NLS-1$ //$NON-NLS-2$
        }

        return attributes;
    }

    private PiAttributesList()
    {
        throw new IllegalStateException(Messages.Internal_class);
    }
}
