#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ТестКадроваяИсторияСотрудников() Экспорт

	Запрос = Новый Запрос;

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	ОписательТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		Запрос.МенеджерВременныхТаблиц, "ВТСотрудники");

	ИменаКадровыхДанных = "";

	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательТаблиц, Истина, ИменаКадровыхДанных);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудников.Сотрудник
	|ПОМЕСТИТЬ ВременнаяТаблица1
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников";

КонецПроцедуры

#КонецЕсли